src/Algorithms/Theory of Algorithms/Sort.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: Sort
#+OPTIONS: num:nil H:2


* Overview
According to information theory, no comparison sort can perform better
than  comparisons in the average case.

|                  | Timesort      | Merge sort    | Quicksort     | Insertion sort | Selection sort | Smoothsort    |
|------------------+---------------+---------------+---------------+----------------+----------------+---------------|
| Best case        | \Theta(n)     | \Theta(nlogn) | \Theta(nlogn) | \Theta(n)      | \Theta(n^2)    | \Theta(n)     |
| Average case     | \Theta(nlogn) | \Theta(nlogn) | \Theta(nlogn) | \Theta(n^2)    | \Theta(n^2)    | \Theta(nlogn) |
| Worst case       | \Theta(nlogn) | \Theta(nlogn) | \Theta(n^2)   | \Theta(n^2)    | \Theta(n^2)    | \Theta(nlogn) |
| Space complexity | \Theta(n)     | \Theta(n)     | \Theta(logn)  | \Theta(1)      | \Theta(1)      | \Theta(1)     |

Note, however, that the space complexity of both Timsort and merge
sort can be reduced to  at the cost of speed

* Merge sort
#+begin_src python
def mergesort(lst, left=0, right=None):
    if right is None:
        right = len(lst) - 1
    if left >= right:
        return
    middle = (left + right) // 2
    mergesort(lst, left, middle)
    mergesort(lst, middle + 1, right)
    i, end_i, j = left, middle, middle + 1
    while i <= end_i and j <= right:
        if lst[i] <= lst[j]:
            i += 1
            continue
        lst[i], lst[i+1:j+1] = lst[j], lst[i:j]
        i, end_i, j = i + 1, end_i + 1, j + 1
#+end_src
* Quicksort
#+begin_src python
def quicksort(lst, left=0, right=None):
    if right is None:
        right = len(lst) - 1
    l = left
    r = right
    if l <= r:
        mid = (lst[left] + lst[right]) / 2
        while l < r:
            while l <= right and lst[l] < mid:
                l += 1
            while r >= left and lst[r] > mid:
                r -= 1
            if l <= r:
                lst[l], lst[r] = lst[r], lst[l]
                l += 1
                r -= 1
        if left < r:
            quicksort(lst, left, r)
        if l < right:
            quicksort(lst, l, right)
#+end_src
* Insertion sort
#+begin_src python
def insertionsort(lst):
    for i in range(1, len(lst)):
        for j in range(i):
            if lst[i] < lst[j]:
                x = lst.pop(i);
                lst.insert(j, x);
#+end_src
* Selection sort
#+begin_src python
def selectionsort(lst):
    for i in range(len(lst) - 1, -1, -1):
        m = lst.index(max(lst[:i+1]))
        lst[m], lst[i] = lst[i], lst[m]
#+end_src
