public_html/Algorithms/Theory of Algorithms/Sort.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Sort</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Sort"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-06-07T20:18+0800"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Sort</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Overview</a></li>
<li><a href="#sec-2">Merge sort</a></li>
<li><a href="#sec-3">Quicksort</a></li>
<li><a href="#sec-4">Insertion sort</a></li>
<li><a href="#sec-5">Selection sort</a></li>
<li><a href="#sec-6">Smoothsort</a></li>
<li><a href="#sec-7">Timesort</a></li>
<li><a href="#sec-8">bitonicsort</a></li>
<li><a href="#sec-9">bubblesort</a></li>
<li><a href="#sec-10">cocktailsort</a></li>
<li><a href="#sec-11">cmobsort</a></li>
<li><a href="#sec-12">cyclesort</a></li>
<li><a href="#sec-13">gnomesort</a></li>
<li><a href="#sec-14">heapsort</a></li>
<li><a href="#sec-15">oddevensort</a></li>
<li><a href="#sec-16">radixsort</a></li>
<li><a href="#sec-17">shellsort</a></li>
<li><a href="#sec-18">stoogesort</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Overview</h2>
<div class="outline-text-2" id="text-1">

<p>According to information theory, no comparison sort can perform better
than  comparisons in the average case.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left">Timesort</th><th scope="col" class="left">Merge sort</th><th scope="col" class="left">Quicksort</th><th scope="col" class="left">Insertion sort</th><th scope="col" class="left">Selection sort</th><th scope="col" class="left">Smoothsort</th></tr>
</thead>
<tbody>
<tr><td class="left">Best case</td><td class="left">&Theta;(n)</td><td class="left">&Theta;(nlogn)</td><td class="left">&Theta;(nlogn)</td><td class="left">&Theta;(n)</td><td class="left">&Theta;(n<sup>2</sup>)</td><td class="left">&Theta;(n)</td></tr>
<tr><td class="left">Average case</td><td class="left">&Theta;(nlogn)</td><td class="left">&Theta;(nlogn)</td><td class="left">&Theta;(nlogn)</td><td class="left">&Theta;(n<sup>2</sup>)</td><td class="left">&Theta;(n<sup>2</sup>)</td><td class="left">&Theta;(nlogn)</td></tr>
<tr><td class="left">Worst case</td><td class="left">&Theta;(nlogn)</td><td class="left">&Theta;(nlogn)</td><td class="left">&Theta;(n<sup>2</sup>)</td><td class="left">&Theta;(n<sup>2</sup>)</td><td class="left">&Theta;(n<sup>2</sup>)</td><td class="left">&Theta;(nlogn)</td></tr>
<tr><td class="left">Space complexity</td><td class="left">&Theta;(n)</td><td class="left">&Theta;(n)</td><td class="left">&Theta;(logn)</td><td class="left">&Theta;(1)</td><td class="left">&Theta;(1)</td><td class="left">&Theta;(1)</td></tr>
</tbody>
</table>


<p>
Note, however, that the space complexity of both Timsort and merge
sort can be reduced to  at the cost of speed
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Merge sort</h2>
<div class="outline-text-2" id="text-2">




<pre class="src src-python"><span style="color: #00ffff;">def</span> <span style="color: #87cefa;">mergesort</span>(lst, <span style="color: #ffebcd; background-color: #2f4f4f;">left</span>=0, <span style="color: #ffebcd; background-color: #2f4f4f;">right</span>=<span style="color: #00ffff;">None</span>):
    <span style="color: #00ffff;">if</span> right <span style="color: #00ffff;">is</span> <span style="color: #00ffff;">None</span>:
        <span style="color: #ffebcd; background-color: #2f4f4f;">right</span> = <span style="color: #b0c4de;">len</span>(lst) - 1
    <span style="color: #00ffff;">if</span> left &gt;= right:
        <span style="color: #00ffff;">return</span>
    <span style="color: #ffebcd; background-color: #2f4f4f;">middle</span> = (left + right) // 2
    mergesort(lst, left, middle)
    mergesort(lst, middle + 1, right)
    i, end_i, j = left, middle, middle + 1
    <span style="color: #00ffff;">while</span> i &lt;= end_i <span style="color: #00ffff;">and</span> j &lt;= right:
        <span style="color: #00ffff;">if</span> lst[i] &lt;= lst[j]:
            i += 1
            <span style="color: #00ffff;">continue</span>
        lst[i], lst[i+1:j+1] = lst[j], lst[i:j]
        i, end_i, j = i + 1, end_i + 1, j + 1
</pre>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Quicksort</h2>
<div class="outline-text-2" id="text-3">




<pre class="src src-python"><span style="color: #00ffff;">def</span> <span style="color: #87cefa;">quicksort</span>(lst, <span style="color: #ffebcd; background-color: #2f4f4f;">left</span>=0, <span style="color: #ffebcd; background-color: #2f4f4f;">right</span>=<span style="color: #00ffff;">None</span>):
    <span style="color: #00ffff;">if</span> right <span style="color: #00ffff;">is</span> <span style="color: #00ffff;">None</span>:
        <span style="color: #ffebcd; background-color: #2f4f4f;">right</span> = <span style="color: #b0c4de;">len</span>(lst) - 1
    l = left
    r = right
    <span style="color: #00ffff;">if</span> l &lt;= r:
        <span style="color: #ffebcd; background-color: #2f4f4f;">mid</span> = (lst[left] + lst[right]) / 2
        <span style="color: #00ffff;">while</span> l &lt; r:
            <span style="color: #00ffff;">while</span> l &lt;= right <span style="color: #00ffff;">and</span> lst[l] &lt; mid:
                l += 1
            <span style="color: #00ffff;">while</span> r &gt;= left <span style="color: #00ffff;">and</span> lst[r] &gt; mid:
                r -= 1
            <span style="color: #00ffff;">if</span> l &lt;= r:
                lst[l], lst[r] = lst[r], lst[l]
                l += 1
                r -= 1
        <span style="color: #00ffff;">if</span> left &lt; r:
            quicksort(lst, left, r)
        <span style="color: #00ffff;">if</span> l &lt; right:
            quicksort(lst, l, right)
</pre>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Insertion sort</h2>
<div class="outline-text-2" id="text-4">




<pre class="src src-python"><span style="color: #00ffff;">def</span> <span style="color: #87cefa;">insertionsort</span>(lst):
    <span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">range</span>(1, <span style="color: #b0c4de;">len</span>(lst)):
        <span style="color: #00ffff;">for</span> j <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">range</span>(i):
            <span style="color: #00ffff;">if</span> lst[i] &lt; lst[j]:
                x = lst.pop(i);
                lst.insert(j, x);
</pre>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Selection sort</h2>
<div class="outline-text-2" id="text-5">




<pre class="src src-python"><span style="color: #00ffff;">def</span> <span style="color: #87cefa;">selectionsort</span>(lst):
    <span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">range</span>(len(lst) - 1, -1, -1):
        m = lst.index(<span style="color: #b0c4de;">max</span>(lst[:i+1]))
        lst[m], lst[i] = lst[i], lst[m]
</pre>

</div>

</div>
