src/Algorithms/Theory of Algorithms/Sort.org
* Smoothsort[fn:2]
#+begin_src python

# Possibly replace with a generator that produces Leonardo numbers?
# That would be of limited utility since this is all of them up to 31 bits.
LP = [ 1, 1, 3, 5, 9, 15, 25, 41, 67, 109, 177, 287, 465, 753, 1219, 1973,
       3193, 5167, 8361, 13529, 21891, 35421, 57313, 92735, 150049, 242785,
       392835, 635621, 1028457, 1664079, 2692537, 4356617, 7049155,
       11405773, 18454929, 29860703, 48315633, 78176337, 126491971,
       204668309, 331160281, 535828591, 866988873 ]

# Solution for determining number of trailing zeroes of a number's binary representation.
# Taken from http://www.0xe3.com/text/ntz/ComputingTrailingZerosHOWTO.html
# don't much like the magic numbers, but they really are magic.
MultiplyDeBruijnBitPosition = [ 0,  1, 28,  2, 29, 14, 24, 3,
                                30, 22, 20, 15, 25, 17,  4, 8,
                                31, 27, 13, 23, 21, 19, 16, 7,
                                26, 12, 18,  6, 11,  5, 10, 9]

def trailingzeroes(v):
    return MultiplyDeBruijnBitPosition[(((v & -v) * 0x077CB531L) >> 27) & 0b11111]


def sift(lst, pshift, head):
    while pshift > 1:
        rc = head - 1
        lc = head - 1 - LP[pshift - 2]
        if lst[head] >= lst[lc] and lst[head] >= lst[rc]:
            break
        elif lst[rc] > lst[lc]:
            lst[head], lst[rc] = lst[rc], lst[head]
            head = rc
            pshift -= 2
        else:
            lst[head], lst[lc] = lst[lc], lst[head]
            head = lc
            pshift -= 1


def trinkle(lst, p, pshift, head):
    while p != 1:
        priorHeap = head - LP[pshift]
        if lst[head] >= lst[priorHeap]:
            break
        lst[head], lst[priorHeap] = lst[priorHeap], lst[head]
        head = priorHeap
        trail = trailingzeroes(p & ~1)
        p >>= trail
        pshift += trail
    sift(lst, pshift, head)

def smoothsort(lst):
    """
    case 0: If there are no elements in the heap, add a tree of order 1
    case 1: If the last two heaps have sizes that differ by one, merge them
    case 2: If the last heap has LP 1, add a singleton heap of LP 0
    case 3: add a singleton heap of LP 1
    """
    #case 0:
    p = 1
    pshift = 1
    head = 0

    while head < len(lst) - 1:
        #case 1:
        if (p & 3) == 3:
            sift(lst, pshift, head)
            p >>= 2
            pshift += 2
        else:
            if LP[pshift - 1] >= len(lst) - 1 - head:
                trinkle(lst, p, pshift, head)
            else:
                sift(lst, pshift, head)

            #case 2
            if pshift == 1:
                p <<= 1
                pshift = 0
            else: #case 3
                p <<= pshift - 1
                pshift = 1
        p |= 1
        head += 1
    trinkle(lst, p, pshift, head)
    while pshift != 1 or p != 1:
        if pshift <= 1:
            trail = trailingzeroes(p & ~1)
            p >>= trail
            pshift += trail
        else:
            p <<= 2
            p ^= 7
            pshift -= 2
            #left child
            trinkle(lst, p >> 1, pshift + 1, head - LP[pshift] - 1)
            trinkle(lst, p, pshift, head - 1)
        head -= 1
#+end_src
* Timesort[fn:1]
#+begin_src python

#+end_src

* bitonicsort[fn:3]
#+begin_src python
import math
ASCENDING = True
DESCENDING = False

def compare(lst, i, j, dir):
    if(dir == (lst[i] > lst[j])):
        lst[i], lst[j] = lst[j], lst[i]

def merge(lst, l, n, dir):
    if n > 1:
        k = n / 2
        for i in range(l, l + k):
            compare(lst, i, i + k, dir)
        merge(lst, l, k, dir)
        merge(lst, l + k, k, dir)

def _bitonicsort(lst, l, n, dir):
    if n > 1:
        k = n / 2
        _bitonicsort(lst, l, k, ASCENDING)
        _bitonicsort(lst, l + k, k, DESCENDING)
        merge(lst, l, n , dir)

def bitonicsort(lst):
    # Length of list must be 2**x, where x is an integer.
    assert math.modf(math.log(len(lst), 2))[0] == 0
    _bitonicsort(lst, 0, len(lst), ASCENDING)
#+end_src
* bubblesort
#+begin_src python
def bubblesort(lst):
    bound = len(lst) - 1
    while 1:
        t = 0
        for j in range(bound):
            if lst[j] > lst[j + 1]:
                lst[j + 1], lst[j] = lst[j], lst[j + 1]
                t = j
        if t == 0:
            break
        bound = t
#+end_src
