src/Algorithms/Theory of Algorithms/Sort.org
* cocktailsort
#+begin_src python
def cocktailsort(lst):
    begin, end = 0, len(lst) - 1
    finished = False
    while not finished:
        finished = True
        for i in xrange(begin, end):
            if lst[i] > lst[i + 1]:
                lst[i], lst[i + 1] = lst[i + 1], lst[i]
                finished = False
        if finished:
            break
        end -= 1
        for i in reversed(xrange(begin,end)):
            if lst[i] > lst[i + 1]:
                lst[i], lst[i + 1] = lst[i + 1], lst[i]
                finished = False
        begin += 1
#+end_src
* cmobsort
#+begin_src python
def combsort(lst):
    gap = len(lst)
    swap = False
    while 1:
        gap = int(gap / 1.25)
        swap = False
        for i in xrange(len(lst) - gap):
            if lst[i] > lst[i + gap]:
                lst[i], lst[i + gap] = lst[i + gap], lst[i]
                swap = True
        if not swap and gap <= 1:
            break
#+end_src
* cyclesort[fn:4]
#+begin_src python

#+end_src
* gnomesort
#+begin_src python
def gnomesort(lst):
    i = 0
    while i < len(lst):
        if i == 0 or lst[i] > lst[i - 1]:
            i += 1
        else:
            lst[i], lst[i - 1] = lst[i - 1], lst[i]
            i -= 1
#+end_src
* heapsort
#+begin_src python
def sift(lst, start, count):
    root = start
    while (root * 2) + 1 < count:
        child = root * 2 + 1
        if child < count - 1 and lst[child] < lst[child + 1]:
            child += 1
        if lst[root] < lst[child]:
            lst[root], lst[child] = lst[child], lst[root]
            root = child
        else:
            return

def heapsort(lst):
    start = len(lst) / 2 - 1
    end = len(lst) - 1
    while start >= 0:
        sift(lst, start, len(lst))
        start -= 1
    while end > 0:
        lst[end], lst[0] = lst[0], lst[end]
        sift(lst, 0, end)
        end -= 1
#+end_src
* oddevensort
#+begin_src python
def oddevensort(lst, nloops=2):
    finished = False
    while not finished:
        finished = True
        for n in xrange(nloops):
            for i in xrange(n, len(lst) - 1, nloops):
                if lst[i] > lst[i + 1]:
                    lst[i], lst[i + 1] = lst[i + 1], lst[i]
                    finished = False
#+end_src
* radixsort
#+begin_src python
from itertools import chain
def radixsort(lst):
    is_sorted = lambda l: all([a < b for a,b in zip(l[:-1], l[1:])])
    shift = 1
    zeros = []
    ones = []
    while not is_sorted(lst):
        orig = lst[:]
        while len(orig) != 0:
            item = orig.pop(0)
            if (item & shift) == 0:
                zeros.append(item)
            else:
                ones.append(item)

            for i, item in enumerate(chain(zeros, orig, ones)):
                lst[i] = item
            if is_sorted(lst):
                return
        shift = shift << 1
        zeros = []
        ones = []
#+end_src
* shellsort
#+begin_src python
def shellsort(lst):
    gaps = [5 , 3, 1]
    for gap in gaps:
        for i in xrange(gap, len(lst)):
            temp = lst[i]
            j = i;
            while j>= gap and lst[j - gap] > temp:
                lst[j] = lst[j - gap]
                j -= gap
            lst[j]= temp
#+end_src
* stoogesort
#+begin_src python
def stoogesort(lst, i=0, j=None):
    if j is None:
        j = len(lst) - 1
    if lst[j] < lst[i]:
        lst[j], lst[i] = lst[i], lst[j]
    if j - i > 1:
        t = (j - i + 1) // 3
        stoogesort(lst, i, j - t)
        stoogesort(lst, i + t, j)
        stoogesort(lst, i, j - t)
#+end_src

