public_html/Algorithms/Theory of Algorithms/Sort.html

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">cocktailsort</h2>
<div class="outline-text-2" id="text-10">




<pre class="src src-python"><span style="color: #00ffff;">def</span> <span style="color: #87cefa;">cocktailsort</span>(lst):
    begin, <span style="color: #ffebcd; background-color: #2f4f4f;">end</span> = 0, <span style="color: #b0c4de;">len</span>(lst) - 1
    <span style="color: #ffebcd; background-color: #2f4f4f;">finished</span> = <span style="color: #00ffff;">False</span>
    <span style="color: #00ffff;">while</span> <span style="color: #00ffff;">not</span> finished:
        <span style="color: #ffebcd; background-color: #2f4f4f;">finished</span> = <span style="color: #00ffff;">True</span>
        <span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">xrange</span>(begin, end):
            <span style="color: #00ffff;">if</span> lst[i] &gt; lst[i + 1]:
                lst[i], lst[i + 1] = lst[i + 1], lst[i]
                <span style="color: #ffebcd; background-color: #2f4f4f;">finished</span> = <span style="color: #00ffff;">False</span>
        <span style="color: #00ffff;">if</span> finished:
            <span style="color: #00ffff;">break</span>
        <span style="color: #ffebcd; background-color: #2f4f4f;">end</span> -= 1
        <span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> reversed(<span style="color: #b0c4de;">xrange</span>(begin,end)):
            <span style="color: #00ffff;">if</span> lst[i] &gt; lst[i + 1]:
                lst[i], lst[i + 1] = lst[i + 1], lst[i]
                <span style="color: #ffebcd; background-color: #2f4f4f;">finished</span> = <span style="color: #00ffff;">False</span>
        <span style="color: #ffebcd; background-color: #2f4f4f;">begin</span> += 1
</pre>

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">cmobsort</h2>
<div class="outline-text-2" id="text-11">




<pre class="src src-python"><span style="color: #00ffff;">def</span> <span style="color: #87cefa;">combsort</span>(lst):
    <span style="color: #ffebcd; background-color: #2f4f4f;">gap</span> = <span style="color: #b0c4de;">len</span>(lst)
    <span style="color: #ffebcd; background-color: #2f4f4f;">swap</span> = <span style="color: #00ffff;">False</span>
    <span style="color: #00ffff;">while</span> 1:
        <span style="color: #ffebcd; background-color: #2f4f4f;">gap</span> = <span style="color: #b0c4de;">int</span>(gap / 1.25)
        <span style="color: #ffebcd; background-color: #2f4f4f;">swap</span> = <span style="color: #00ffff;">False</span>
        <span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">xrange</span>(len(lst) - gap):
            <span style="color: #00ffff;">if</span> lst[i] &gt; lst[i + gap]:
                lst[i], lst[i + gap] = lst[i + gap], lst[i]
                <span style="color: #ffebcd; background-color: #2f4f4f;">swap</span> = <span style="color: #00ffff;">True</span>
        <span style="color: #00ffff;">if</span> <span style="color: #00ffff;">not</span> swap <span style="color: #00ffff;">and</span> gap &lt;= 1:
            <span style="color: #00ffff;">break</span>
</pre>

</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">cyclesort<sup><a class="footref" name="fnr-.4" href="#fn-.4">4</a></sup></h2>
<div class="outline-text-2" id="text-12">




<pre class="src src-python"></pre>

</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">gnomesort</h2>
<div class="outline-text-2" id="text-13">




<pre class="src src-python"><span style="color: #00ffff;">def</span> <span style="color: #87cefa;">gnomesort</span>(lst):
    i = 0
    <span style="color: #00ffff;">while</span> i &lt; <span style="color: #b0c4de;">len</span>(lst):
        <span style="color: #00ffff;">if</span> i == 0 <span style="color: #00ffff;">or</span> lst[i] &gt; lst[i - 1]:
            i += 1
        <span style="color: #00ffff;">else:</span>
            lst[i], lst[i - 1] = lst[i - 1], lst[i]
            i -= 1
</pre>

</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14">heapsort</h2>
<div class="outline-text-2" id="text-14">




<pre class="src src-python"><span style="color: #00ffff;">def</span> <span style="color: #87cefa;">sift</span>(lst, start, count):
    <span style="color: #ffebcd; background-color: #2f4f4f;">root</span> = start
    <span style="color: #00ffff;">while</span> (root * 2) + 1 &lt; count:
        <span style="color: #ffebcd; background-color: #2f4f4f;">child</span> = root * 2 + 1
        <span style="color: #00ffff;">if</span> child &lt; count - 1 <span style="color: #00ffff;">and</span> lst[child] &lt; lst[child + 1]:
            <span style="color: #ffebcd; background-color: #2f4f4f;">child</span> += 1
        <span style="color: #00ffff;">if</span> lst[root] &lt; lst[child]:
            lst[root], lst[child] = lst[child], lst[root]
            <span style="color: #ffebcd; background-color: #2f4f4f;">root</span> = child
        <span style="color: #00ffff;">else:</span>
            <span style="color: #00ffff;">return</span>

<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">heapsort</span>(lst):
    <span style="color: #ffebcd; background-color: #2f4f4f;">start</span> = <span style="color: #b0c4de;">len</span>(lst) / 2 - 1
    <span style="color: #ffebcd; background-color: #2f4f4f;">end</span> = <span style="color: #b0c4de;">len</span>(lst) - 1
    <span style="color: #00ffff;">while</span> start &gt;= 0:
        sift(lst, start, <span style="color: #b0c4de;">len</span>(lst))
        <span style="color: #ffebcd; background-color: #2f4f4f;">start</span> -= 1
    <span style="color: #00ffff;">while</span> end &gt; 0:
        lst[end], lst[0] = lst[0], lst[end]
        sift(lst, 0, end)
        <span style="color: #ffebcd; background-color: #2f4f4f;">end</span> -= 1
</pre>

</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15">oddevensort</h2>
<div class="outline-text-2" id="text-15">




<pre class="src src-python"><span style="color: #00ffff;">def</span> <span style="color: #87cefa;">oddevensort</span>(lst, <span style="color: #ffebcd; background-color: #2f4f4f;">nloops</span>=2):
    <span style="color: #ffebcd; background-color: #2f4f4f;">finished</span> = <span style="color: #00ffff;">False</span>
    <span style="color: #00ffff;">while</span> <span style="color: #00ffff;">not</span> finished:
        <span style="color: #ffebcd; background-color: #2f4f4f;">finished</span> = <span style="color: #00ffff;">True</span>
        <span style="color: #00ffff;">for</span> n <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">xrange</span>(nloops):
            <span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">xrange</span>(n, <span style="color: #b0c4de;">len</span>(lst) - 1, nloops):
                <span style="color: #00ffff;">if</span> lst[i] &gt; lst[i + 1]:
                    lst[i], lst[i + 1] = lst[i + 1], lst[i]
                    <span style="color: #ffebcd; background-color: #2f4f4f;">finished</span> = <span style="color: #00ffff;">False</span>
</pre>

</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16">radixsort</h2>
<div class="outline-text-2" id="text-16">




<pre class="src src-python"><span style="color: #00ffff;">from</span> itertools <span style="color: #00ffff;">import</span> chain
<span style="color: #00ffff;">def</span> <span style="color: #87cefa;">radixsort</span>(lst):
    <span style="color: #ffebcd; background-color: #2f4f4f;">is_sorted</span> = <span style="color: #00ffff;">lambda</span> l: <span style="color: #b0c4de;">all</span>([a &lt; b <span style="color: #00ffff;">for</span> a,b <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">zip</span>(l[:-1], l[1:])])
    <span style="color: #ffebcd; background-color: #2f4f4f;">shift</span> = 1
    <span style="color: #ffebcd; background-color: #2f4f4f;">zeros</span> = []
    <span style="color: #ffebcd; background-color: #2f4f4f;">ones</span> = []
    <span style="color: #00ffff;">while</span> <span style="color: #00ffff;">not</span> is_sorted(lst):
        <span style="color: #ffebcd; background-color: #2f4f4f;">orig</span> = lst[:]
        <span style="color: #00ffff;">while</span> <span style="color: #b0c4de;">len</span>(orig) != 0:
            <span style="color: #ffebcd; background-color: #2f4f4f;">item</span> = orig.pop(0)
            <span style="color: #00ffff;">if</span> (item &amp; shift) == 0:
                zeros.append(item)
            <span style="color: #00ffff;">else:</span>
                ones.append(item)

            <span style="color: #00ffff;">for</span> i, item <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">enumerate</span>(chain(zeros, orig, ones)):
                lst[i] = item
            <span style="color: #00ffff;">if</span> is_sorted(lst):
                <span style="color: #00ffff;">return</span>
        <span style="color: #ffebcd; background-color: #2f4f4f;">shift</span> = shift &lt;&lt; 1
        <span style="color: #ffebcd; background-color: #2f4f4f;">zeros</span> = []
        <span style="color: #ffebcd; background-color: #2f4f4f;">ones</span> = []
</pre>

</div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17">shellsort</h2>
<div class="outline-text-2" id="text-17">




<pre class="src src-python"><span style="color: #00ffff;">def</span> <span style="color: #87cefa;">shellsort</span>(lst):
    <span style="color: #ffebcd; background-color: #2f4f4f;">gaps</span> = [5 , 3, 1]
    <span style="color: #00ffff;">for</span> gap <span style="color: #00ffff;">in</span> gaps:
        <span style="color: #00ffff;">for</span> i <span style="color: #00ffff;">in</span> <span style="color: #b0c4de;">xrange</span>(gap, <span style="color: #b0c4de;">len</span>(lst)):
            <span style="color: #ffebcd; background-color: #2f4f4f;">temp</span> = lst[i]
            j = i;
            <span style="color: #00ffff;">while</span> j&gt;= gap <span style="color: #00ffff;">and</span> lst[j - gap] &gt; temp:
                lst[j] = lst[j - gap]
                j -= gap
            lst[j]= temp
</pre>

</div>

</div>

<div id="outline-container-18" class="outline-2">
<h2 id="sec-18">stoogesort</h2>
<div class="outline-text-2" id="text-18">




<pre class="src src-python"><span style="color: #00ffff;">def</span> <span style="color: #87cefa;">stoogesort</span>(lst, i=0, j=<span style="color: #00ffff;">None</span>):
    <span style="color: #00ffff;">if</span> j <span style="color: #00ffff;">is</span> <span style="color: #00ffff;">None</span>:
        j = <span style="color: #b0c4de;">len</span>(lst) - 1
    <span style="color: #00ffff;">if</span> lst[j] &lt; lst[i]:
        lst[j], lst[i] = lst[i], lst[j]
    <span style="color: #00ffff;">if</span> j - i &gt; 1:
        t = (j - i + 1) // 3
        stoogesort(lst, i, j - t)
        stoogesort(lst, i + t, j)
        stoogesort(lst, i, j - t)
</pre>
